Autodesk.Revit.DB.SpotDimension.CreateAlignmentStationLabelSet(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId,System.Double,System.Double,System.Double,System.Double)
Creates a new instance of an AlignmentStationLabel element in the document.
host:
The host alignment element to which the new AlignmentStationLabelSet is attached.
dbView:
The view in which the AlignmentStationLabelSet will appear.
typeId:
The type ID of the labels in the set.
Returns:
The array of elements of newly created AlignmentStationLabel instances.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.SpotDimension.CreateAlignmentStationLabel(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.View,Autodesk.Revit.DB.XYZ,System.Boolean,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Creates a new instance of an AlignmentStationLabel element in the document.
host:
The host alignment element to which the new AlignmentStationLabel is attached.
dbView:
The view in which the AlignmentStationLabel will appear.
Returns:
The newly created AlignmentStationLabel instance, or null if the operation fails.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.SpotDimension.Flip
Flips dimension to the other side of the host.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
SpotDimension cannot be flipped.
Since:
2021.2

Autodesk.Revit.DB.SpotDimension.CanFlip
Verifies that the direction of the dimension can be flipped.
Remarks:
Currently, flipping only allowed for non-pinned AlignmentStationLabels.
Returns:
True if the element can be flipped, false otherwise.
Since:
2021.2

Autodesk.Revit.DB.SpotDimension.LeaderShoulderPosition
Position of spot dimension's leader shoulder point.
Remarks:
Setting of this property also affects LeaderEndPosition and TextPosition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Dimension must have leader.
-or-
Dimension's leader must have shoulder.
-or-
Thrown when:
SpotDimension style type is SpotSlope.Using equality formula.Dimension style is ordinate.
-or-
The dimension is a SpotSlope or has no leader or leader has no shoulder.
Since:
2021.1

Autodesk.Revit.DB.SpotDimension.LeaderHasShoulder
True is dimension has leader with shoulder, false otherwise.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Dimension must have leader.
-or-
Thrown when:
SpotDimension style type is SpotSlope.Using equality formula.Dimension style is ordinate.
-or-
The dimension is a SpotSlope or has no leader.
Since:
2021.1

Autodesk.Revit.DB.SpotDimension.SpotDimensionType
The dimension style of this dimension.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null

Autodesk.Revit.DB.SpotDimension
Object representing various types of SpotDimension